Revit 2024 API
Rebar.ConstraintsCanBeEdited Method
For ShapeDriven Rebar: returns true, if the Rebar element's external constraints are available for editing using the RebarConstraintsManager class. It will return false if Rebar is in Group
For FreeForm rebar: constraints can be edited if there is a valid external server Guid assigned to that Rebar
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool ConstraintsCanBeEdited()
Visual Basic
Public Function ConstraintsCanBeEdited As Boolean
Visual C++
public:
bool ConstraintsCanBeEdited()
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace